# IntelliJ Keybindings
k--kato.intellij-idea-keybindings

# Python
ms-python.python
ms-python.vscode-pylance
charliermarsh.ruff

# TypeScript / JavaScript
esbenp.prettier-vscode

# AI
anthropic.claude-code

# Git
eamodio.gitlens

# Docker & Remote
ms-azuretools.vscode-containers
ms-vscode-remote.remote-containers

# Infrastructure
hashicorp.terraform
redhat.vscode-yaml

# Justfiles
nefrob.vscode-just-syntax

# Editor Enhancements
usernamehw.errorlens
tamasfe.even-better-toml
EditorConfig.EditorConfig

# GitHub
github.vscode-github-actions

# Themes
trinm1709.dracula-theme-from-intellij

# Markdown
yzhang.markdown-all-in-one
DarrenJMcLeod.markdown-toggle-preview
